data.aws_availability_zones.az: Reading...
aws_vpc.vpc: Refreshing state... [id=vpc-042f443a555b472dd]
data.aws_ami.linux2_ami: Reading...
data.aws_availability_zones.az: Read complete after 0s [id=eu-west-1]
aws_internet_gateway.igw: Refreshing state... [id=igw-08b7b05ffa0d3c47d]
aws_subnet.db[0]: Refreshing state... [id=subnet-0381c18cfca2f84bc]
aws_security_group.web_sg: Refreshing state... [id=sg-00eb560805fa2852b]
aws_subnet.private[0]: Refreshing state... [id=subnet-052a57d7d10bdda8a]
aws_subnet.db[1]: Refreshing state... [id=subnet-02076c2411569692b]
aws_subnet.private[1]: Refreshing state... [id=subnet-08f037945334c6233]
aws_route_table.public_rt: Refreshing state... [id=rtb-055267c03744a840d]
aws_subnet.public[0]: Refreshing state... [id=subnet-048f10346102a5258]
aws_subnet.public[1]: Refreshing state... [id=subnet-0132587a981d8f08e]
aws_security_group.lb_sg: Refreshing state... [id=sg-0214ff4af83b51c98]
aws_security_group.db_sg: Refreshing state... [id=sg-09eb5027eb901afaa]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=rds-subnet-group]
aws_route_table_association.public_rt_association[1]: Refreshing state... [id=rtbassoc-0f76a521c18111ba3]
aws_route_table_association.public_rt_association[0]: Refreshing state... [id=rtbassoc-090ebde548d7e604c]
aws_lb.lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:825144470306:loadbalancer/app/wordpress-load-balancer/20733d571b6e13d0]
aws_db_instance.rds: Refreshing state... [id=terraform-20220713213009981400000001]
data.aws_ami.linux2_ami: Read complete after 3s [id=ami-0bba0a4cb75835f71]
aws_instance.web_server[0]: Refreshing state... [id=i-0ca67e17ae23fc034]
aws_instance.web_server[1]: Refreshing state... [id=i-07ceb69ae329cc6ea]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb_listener.lb_listener will be created
  + resource "aws_lb_listener" "lb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:825144470306:loadbalancer/app/wordpress-load-balancer/20733d571b6e13d0"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "App"         = "wordpress"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all          = {
          + "App"         = "wordpress"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.tg will be created
  + resource "aws_lb_target_group" "tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "wordpress-target-group"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "App"         = "wordpress"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + tags_all                           = {
          + "App"         = "wordpress"
          + "Owner"       = "dimitartachev"
          + "Provisioner" = "terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-042f443a555b472dd"

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_lb_target_group_attachment.tg_attachment["i-07ceb69ae329cc6ea"] will be created
  + resource "aws_lb_target_group_attachment" "tg_attachment" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "i-07ceb69ae329cc6ea"
    }

  # aws_lb_target_group_attachment.tg_attachment["i-0ca67e17ae23fc034"] will be created
  + resource "aws_lb_target_group_attachment" "tg_attachment" {
      + id               = (known after apply)
      + target_group_arn = (known after apply)
      + target_id        = "i-0ca67e17ae23fc034"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.